<?php
	if(!defined("MAIN_CONTROLLER"))
		die("invalid request!");
	define("MAIN_VIEW", true);

?>
<body>
	<div id="content">

		<div class="row">
			<div class="block" style="width: 62%; padding: 0 0 0 30px;">
				<div class="index_border">
					<h3>Καλώς ορίσατε <?= $User->fullname ?> στην ιστοσελίδα e-Supply Chain.</h3>
					
					<p class="text_index">Μέσω αυτής της εφαρμογής οι χρήστες ανάλογα με την ιδιότητα που έχουν, 
					   μπορούν να διαχειρίζονται τις παραγγελίες και τις ανάγκες μια επιχείρησης.
					</p>

					<?php if( $User->type == "admin" ) { ?>

						<p class="text_index">Ως <strong>αφεντικό</strong> έχετε ότι επιλογές έχουν οι άλλοι χρήστες (Αποθηκάριος, Κουμανταδόρος, Πωλητής) 
							και επιπλέον τις εξής: Χρήστες, Στατιστικά, Τιμοκατάλογος.
						</p>

						<ul>
							<li class="text_index">
								Πατώντας την επιλογή Χρήστες, μπορείτε να κάνετε διαχείριση των χρηστών 
								της εφαρμογής όπως προβολή και προσθήκη νέου χρήστη.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Στατιστικά, έχετε την δυνατότητα να βλέπετε τα κέρδη 
								και τις πωλήσεις της επιχείρησής σας τα οποία απεικονίζονται και 
								με γραφικές παραστάσεις.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Τιμοκατάλογος, παρουσιάζεται πίνακας με όλα τα 
								προϊόντα και τις αντίστοιχες τιμές αγοράς και πώλησης απ' όπου μπορείτε 
								να κάνετε προσθήκη νέου προϊόντος ή επεξεργασία κάποιου είδη υπάρχοντος.
							</li>

						</ul>

					<?php } if($User->type == "storekeeper" ) { ?>

						<p class="text_index">Ως <strong>αποθηκάριος</strong> έχετε τις εξής επιλογές: Αποθέματα, Παραλαβή, 
							Αποστολή, Προφίλ χρήστη και Αποσύνδεση.
						</p>

						<ul>
							<li class="text_index">
								Πατώντας την επιλογή Αποθέματα εμφανίζεται πίνακας με
								όλα τα διαθέσιμα αποθέματα προϊόντων και μπορείτε να κάνετε αναζήτηση όποια χρειάζεστε.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Παραλαβή παρουσιάζεται πίνακας με
								όλο το ιστορικό προμηθειών και μπορείτε να δείτε για κάθε προμηθευτή 
								περισσότερες πληροφορίες πατώντας το σχετικό κουμπί.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Αποστολή εμφανίζεται πίνακας με το
								ιστορικό όλων των παραγγελιών που έχουν κάνει οι πωλητές και 
								υποστηρίζεται αναζήτηση σε όποια παραγγελία χρειάζεστε.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Προφίλ χρήστη μπορείτε να κάνετε ρυθμίσεις 
								που αφορούν τον λογαριασμό σας όπως π.χ αλλαγή κωδικού πρόσβασης.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Αποσύνδεση, αποσυνδέεστε από τον λογαριασμό σας 
								και επιστρέφετε στην αρχική σελίδα της εφαρμογής.
							</li>

						</ul>

					<?php } if($User->type == "manager") { ?>


						<p class="text_index">Ως <strong>Κουμανταδόρος</strong> έχετε τις εξής επιλογές: Νέα Προμήθεια, Αποθέματα, 
							Ιστορικό Προμηθειών, Προμηθευτές, Προφίλ χρήστη και Αποσύνδεση.
						</p>

						<ul>
							<li class="text_index">
								Πατώντας την επιλογή Νέα Προμήθεια, παρουσιάζονται όλοι οι διαθέσιμοι 
								προμηθευτές απ' όπου μπορείτε να επιλέξετε (και με χρήση αναζήτησης) 
								έναν και να πραγματοποιήσετε Νέα Προμήθεια.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Αποθέματα, παρουσιάζεται πίνακας με τα διαθέσιμα 
								αποθέματα προϊόντων και μπορείτε να τικάρετε όποιο χρειάζεστε και 
								να το παραγγείλετε.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Ιστορικό Προμηθειών, εμφανίζεται πίνακας με το 
								ιστορικό προμηθειών και πατώντας το σχετικό κουμπί είναι διαθέσιμες 
								οι πληροφορίες για κάθε προμηθευτή.
							</li>
							
							<li class="text_index">
								Πατώντας την επιλογή Πρόταση Προμήθειας, εμφανίζεται πίνακας με τα
								προϊόντα, των οποίων το φυσικό διαθέσιμο απόθεμα είναι κάτω από το 
								110% της οριακής ποσότητας, καθώς και η ποσότητα που βρίσκεται σε 
								έλλειψη, βάση των ενεργών παραγγελιών.
							</li>
							
							<li class="text_index">
								Πατώντας την επιλογή Προμηθευτές, εμφανίζεται πίνακας με όλους τους 
								διαθέσιμους προμηθευτές και μπορείτε να κάνετε εισαγωγή νέου προμηθευτή.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Προφίλ χρήστη μπορείτε να κάνετε ρυθμίσεις που 
								αφορούν τον λογαριασμό σας όπως π.χ αλλαγή κωδικού πρόσβασης.
							</li>
							
							<li class="text_index">
								Πατώντας την επιλογή Αποσύνδεση, αποσυνδέεστε από τον λογαριασμό σας και 
								επιστρέφετε στην αρχική σελίδα της εφαρμογής.
							</li>
						</ul>



					<?php } if($User->type == "seller") { ?>

						<p class="text_index">Ως <strong>πωλητής</strong> έχετε τις εξής επιλογές: Νέα Παραγγελία, Ιστορικό παραγγελιών, 
							Πελάτες, Αποθέματα, Προφίλ χρήστη και Αποσύνδεση.
						</p>

						<ul>
							<li class="text_index">
								Πατώντας την επιλογή Νέα Παραγγελία, παρουσιάζεται πίνακας με όλους τους 
								διαθέσιμους προμηθευτές απ' όπου μπορείτε να επιλέξετε όποιον προμηθευτή 
								επιθυμείτε (και με χρήση αναζήτησης) και να πραγματοποιήσετε νέα παραγγελία.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Ιστορικό παραγγελιών, εμφανίζεται ένας πίνακας με που
								απεικονίζει ποιες παραγγελίες είναι ολοκληρωμένες και ποιες όχι και κάθε παραγγελία
								είναι σύνδεσμος (link) προς την επιλογή Νέα παραγγελία για τυχόν επεξεργασία της.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Πελάτες, παρουσιάζεται πίνακας με όλους τους διαθέσιμους 
								πελάτες απ΄ όπου μπορείτε να προσθέσετε ή να δείτε πληροφορίες για όποιον επιθυμείτε.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Αποθέματα, εμφανίζεται πίνακας με όλα τα διαθέσιμα 
								αποθέματα προϊόντων.
							</li>

							<li class="text_index">
								Πατώντας την επιλογή Προφίλ χρήστη μπορείτε να κάνετε ρυθμίσεις που αφορούν 
								τον λογαριασμό σας όπως π.χ αλλαγή κωδικού πρόσβασης.
							</li>
							
							<li class="text_index">
								Πατώντας την επιλογή Αποσύνδεση, αποσυνδέεστε από τον λογαριασμό σας και 
								επιστρέφετε στην αρχική σελίδα της εφαρμογής.
							</li>

						</ul>
					<?php } ?>

				</div>
			</div>

			<div class="block" style="width: 34%;">
				<div class="img_index">
					<?php if( $User->type == "admin") { ?>

							<img src="view/img/afentiko.png" />

					<?php } if( $User->type == "storekeeper") { ?>

							<img src="view/img/apothikarios.png" />

					<?php } if( $User->type == "manager") { ?>

							<img src="view/img/koumantadoros.png" />

					<?php } if( $User->type == "seller") { ?>

							<img src="view/img/pwlhths.png" />

					<?php } ?>
				</div>
			</div>

		</div>
	</div>
	<br/>
</body>